**1**

**a.**

In [1]:
alphabet = 'abcdefghijklmnopqrstuvwxyz'
word = 'pneumonoultramicroscopicsilicovolcanoconiosisis'

listLetters = list(word)
print(listLetters)

['p', 'n', 'e', 'u', 'm', 'o', 'n', 'o', 'u', 'l', 't', 'r', 'a', 'm', 'i', 'c', 'r', 'o', 's', 'c', 'o', 'p', 'i', 'c', 's', 'i', 'l', 'i', 'c', 'o', 'v', 'o', 'l', 'c', 'a', 'n', 'o', 'c', 'o', 'n', 'i', 'o', 's', 'i', 's', 'i', 's']

**b.**

In [2]:
setLetters = set(listLetters)
print(setLetters)

{'o', 't', 'u', 'm', 'v', 'p', 'i', 'c', 'e', 'a', 'l', 'n', 's', 'r'}

**c.**

In [3]:
U = set(alphabet)
print(U.difference(setLetters))

{'x', 'k', 'g', 'q', 'w', 'y', 'z', 'b', 'j', 'd', 'f', 'h'}

**d.**

In [4]:
myDict = dict()
for letter in setLetters:
    myDict[letter] = word.count(letter)
print(myDict)

{'o': 9, 't': 1, 'u': 2, 'm': 2, 'v': 1, 'p': 2, 'i': 7, 'c': 6, 'e': 1, 'a': 2, 'l': 3, 'n': 4, 's': 5, 'r': 2}

**2**

**a.**

In [5]:
word2 = 'supercalifragilisticexpialidocious'

A = setLetters
B = set(word2)
Ac = U.difference(A)
Bc = U.difference(B)

print(A.union(B))
print(A.intersection(B))

{'t', 'x', 'g', 'p', 'i', 'e', 'a', 'n', 's', 'f', 'o', 'u', 'm', 'v', 'c', 'l', 'd', 'r'}
{'o', 't', 'u', 'p', 'i', 'c', 'e', 'a', 'l', 's', 'r'}

**b.**

In [6]:
print(A.difference(B))
print(B.difference(A))
print(B.difference(A).union(A.difference(B)))

{'n', 'm', 'v'}
{'d', 'x', 'g', 'f'}
{'x', 'm', 'v', 'n', 'd', 'g', 'f'}

**c.**

In [7]:
print(A.difference(B) == A.intersection(Bc) or 
     A.difference(B) == B.intersection(Ac))

True

**d.**

In [8]:
#~(A u B) == ~A n ~B
print(U.difference(A.union(B)) == 
      Ac.intersection(Bc))
#~(A n B) == ~A u ~B
print(U.difference(A.intersection(B)) == 
      Ac.union(Bc))

True
True

**3**

**a.**

In [9]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('titanic.csv')
pd.isna(titanic.cabin).any()

True

The statement above checks to see if any entries in the cabin column was empty. This follows the logic lecture as you can reformat this statement into r1.cabin = empty or r2.cabin = empty or ... which is a logical statement.

**b.**

In [10]:
fareMask = (titanic.fare == titanic.fare.min()) & (titanic.survived == True)
len(titanic[fareMask].index)

2

**c.**

In [11]:
print(titanic[((titanic.sex == 'female') & (titanic.pclass == 1) & (titanic.embarked == 'C') & (titanic['home.dest'].str.contains('Cooperstown, NY')) & (titanic.age <= 18))].name)

250    Ryerson, Miss. Emily Borie
Name: name, dtype: object

**d.**

In [12]:
len(titanic[(titanic.fare == 0.0) & (titanic.cabin.isnull() == True) & (titanic['home.dest'].isnull() == True) & (titanic.survived == True)]) > 0

True

**4**

**a.**

In [13]:
myMean = titanic.fare.mean()
titanic[(abs(titanic.fare - myMean) < 0.5)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
300,1.0,0.0,"Van der hoef, Mr. Wyckoff",male,61.0,0.0,0.0,111240,33.5,B19,S,NaN,245.0,"Brooklyn, NY"
430,2.0,1.0,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0.0,1.0,248727,33.0,NaN,S,11,NaN,"Denmark Hill, Surrey / Chicago"
431,2.0,0.0,"Harper, Rev. John",male,28.0,0.0,1.0,248727,33.0,NaN,S,NaN,NaN,"Denmark Hill, Surrey / Chicago"
483,2.0,1.0,"Leitch, Miss. Jessie Wills",female,NaN,0.0,0.0,248727,33.0,NaN,S,11,NaN,"London / Chicago, IL"

**b.**

In [14]:
ticketMask = (titanic.ticket.isnull() == False)
ticketUseSeries = titanic[ticketMask].ticket.value_counts()
arr = ticketUseSeries.values
arr = arr[arr > 1]
len(arr)
#There was a ticket used 11 times!

216

**c.**

In [15]:
lucky = (titanic.pclass != 1) & (titanic.fare <= myMean) & (titanic.survived == True)
unlucky = (titanic.pclass == 1) & (titanic.fare > myMean) & (titanic.survived == False)
avgluck = ~(lucky | unlucky)

titanic.loc[lucky, 'luck'] = 'lucky'
titanic.loc[unlucky, 'luck'] = 'unlucky'
titanic.loc[avgluck, 'luck'] = 'averageluck'

titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,luck
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",averageluck
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",averageluck
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",unlucky
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",unlucky
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",unlucky

**d.**

In [16]:
titanic.groupby(['luck']).size()

luck
averageluck    956
lucky          277
unlucky         77
dtype: int64

**5**

**a.**

In [17]:
DF1 = pd.DataFrame({'ID': ['s01', 's05', 's06', 's08'],
                    'Name': ['Julie', 'Carl', 'Luke', 'David'],
                    'City': ['Des Moines', 'Iowa city', 'Chicago', 'Minneapolis'],
                    'Age': [25, 34, 29, 45]})

DF2 = pd.DataFrame({'ID': ['s01', 's08', 's03', 's04'],
                    'Name': ['Julie', 'David', 'Bradley', 'Nina'],
                    'City': ['Des Moines', 'Minneapolis', 'Tempe', 'Pittsburg'],
                    'GPA': [3.25, 3.4, 3.3, 4]})

df = pd.merge(DF1, DF2, how='left', on='ID')
df.head()

    ID Name_x       City_x  Age Name_y       City_y   GPA
0  s01  Julie   Des Moines   25  Julie   Des Moines  3.25
1  s05   Carl    Iowa city   34    NaN          NaN   NaN
2  s06   Luke      Chicago   29    NaN          NaN   NaN
3  s08  David  Minneapolis   45  David  Minneapolis  3.40

merging left represents the operation (left intersection right) union left, we only added data to our dataframe if the IDs were in both dataframes. This is why there are NaNs since ID s05 and s06 weren't found in the right dataframe.

**b.**

In [18]:
df2 = pd.merge(DF1, DF2, how='right', on='ID')
df2.head()

    ID Name_x       City_x   Age   Name_y       City_y   GPA
0  s01  Julie   Des Moines  25.0    Julie   Des Moines  3.25
1  s08  David  Minneapolis  45.0    David  Minneapolis  3.40
2  s03    NaN          NaN   NaN  Bradley        Tempe  3.30
3  s04    NaN          NaN   NaN     Nina    Pittsburg  4.00

**c.**

In [19]:
df2 = pd.merge(DF1, DF2, how='inner', on='ID')
df2.head()

    ID Name_x       City_x  Age Name_y       City_y   GPA
0  s01  Julie   Des Moines   25  Julie   Des Moines  3.25
1  s08  David  Minneapolis   45  David  Minneapolis  3.40

Intersects the keys from both lists so since s05 and s06 weren't in both lists they were removed thus removing the NaNs.

**d.**

In [20]:
df2 = pd.merge(DF1, DF2, how='outer', on='ID')
df2.head()

    ID Name_x       City_x   Age   Name_y       City_y   GPA
0  s01  Julie   Des Moines  25.0    Julie   Des Moines  3.25
1  s05   Carl    Iowa city  34.0      NaN          NaN   NaN
2  s06   Luke      Chicago  29.0      NaN          NaN   NaN
3  s08  David  Minneapolis  45.0    David  Minneapolis  3.40
4  s03    NaN          NaN   NaN  Bradley        Tempe  3.30